{"data":[{"description":"Friday, November 18th\n7:00-8:00PM\n\nSt. James' Episcopal Church\n37051 Cabrillo Terrace, Fremont CA\n________________________________________________\n\nTake a stand against homelessness!\n\nJoin Abode Services for an interfaith candlelight vigil to remember and reflect on the lives affected by homelessness.\n\nBring your canned goods and other non-perishable items to donate.\n\nPlease use the following hashtags:\n#NHHAW\n#AbodeServices\n\nFor more information contact:\nChristina Praseuth at (510) 657-7409 x223\ncpraseuth\u0040abodeservices.org","end_time":"2016-11-18T20:00:00-0800","name":"Candlelight Vigil","place":{"name":"Saint James' Episcopal Church, Fremont CA","location":{"city":"Fremont","country":"United States","latitude":37.55125367,"longitude":-122.01726426667,"state":"CA","street":"37051 Cabrillo Dr","zip":"94536-5721"},"id":"100122006782364"},"start_time":"2016-11-18T19:00:00-0800","id":"937968106346635"},{"description":"As part of Affordable Housing Week, the panel will discuss supportive housing options to address homelessness. It will be moderated by Jacky Morales-Ferrand, City of San Jose Housing Department. Speakers will include Hilary Barroga, Office of Supportive Housing of the County of Santa Clara;  Megan Colvard, PATH Ventures; Katherine Harasz, Housing Authority of the County of Santa Clara; Jennifer Loving, Destination: Home; Kathy Robinson, Charities Housing; and Vivian Wan, Abode Services.","end_time":"2016-05-16T14:00:00-0700","name":"Housing Options to End Homelessness Panel","place":{"name":"Santa Clara County Association of Realtors, 1651 N. First St., San Jose"},"start_time":"2016-05-16T12:30:00-0700","id":"271473473193595"},{"description":"Please join Abode Services this year as we raise awareness and promote advocacy during National Hunger and Homelessness Awareness Week.\n\nIn recognition of #NHHAW we will be holding:\n\n\"Feed Your Soul\" evening of music:\nThursday, November 19th\n7 - 9 p.m.\nMission Coffee\n151 Washington Blvd in Fremont\n\nEnjoy an evening of live music while learning more about the impact homelessness has on individuals, families, and our community.\n\nEvent is free to attend - donations of gift cards and canned food at the door are greatly appreciated!\n\nEarlier in the week we will also be hosting an interfaith Candlelight Vigil , click here: https:\/\/www.facebook.com\/events\/106862343011202\/ for event details.\n\nStay tuned to our Facebook, Twitter, and Instagram for more information on events, ways to get involved, and other #NHHAW updates. \nEducate. Advocate. Let's end homelessness!\n\nFor more information about these events, contact Rosa Baeza at (510) 657-7409 ext. 220 or rbaeza\u0040abodeservices.org","end_time":"2015-11-19T21:00:00-0800","name":"Feed Your Soul: An Evening of Music","place":{"name":"Mission Coffee Roasting Company","location":{"city":"Fremont","country":"United States","latitude":37.5334999,"longitude":-121.92091,"state":"CA","street":"151 Washington Blvd","zip":"94539"},"id":"199501583458576"},"start_time":"2015-11-19T19:00:00-0800","id":"1023228674368513"},{"description":"Please join Abode Services this year as we raise awareness and promote advocacy during National Hunger and Homelessness Awareness Week.\n\nIn recognition of #NHHAW we will be holding:\n\nCandlelight Vigil \nSunday, November 15th \n7 - 8 p.m.\nSt James' Episcopal Church\n37051 Cabrillo Terrace in Fremont\n(Thornton Ave. at Cabrillo)\n\nThis Candlelight Vigil will honor members of our community whose lives have been lost while homeless.\n\nDonations of gift cards and canned food at the door are greatly appreciated!\n\nLater in the week, we will  be hosting a music night at Mission Coffee in Fremont, click here: https:\/\/www.facebook.com\/events\/1023228674368513\/  for event details.\n\nStay tuned to our Facebook, Twitter, and Instagram for more information on events, ways to get involved, and other #NHHAW updates. \nEducate. Advocate. Let's end homelessness!\n \nFor more information about these events, contact Rosa Baeza at (510) 657-7409 ext. 220 or rbaeza\u0040abodeservices.org","end_time":"2015-11-15T20:00:00-0800","name":"Candlelight Vigil","place":{"name":"Saint James' Episcopal Church, Fremont CA","location":{"city":"Fremont","country":"United States","latitude":37.55125367,"longitude":-122.01726426667,"state":"CA","street":"37051 Cabrillo Dr","zip":"94536-5721"},"id":"100122006782364"},"start_time":"2015-11-15T19:00:00-0800","id":"106862343011202"},{"description":"Do you remember the last time you moved? It’s an emotional time for anyone, especially for people who are moving back into a home after being homeless. On May 5th, you have the opportunity to make that transition easier- we’re calling it “Moving Day”.\n\nWith the click of a mouse, you can make a donation on May 5th during #EastBayGives that will help pay for the expenses associated with moving: furniture, linens, kitchenware, utility bills, and even security deposits.\n\nThis year, our goal is to raise $10,000 and find 50 new donors willing to make a donation to help our participants move into a new home. Contributions start at $20 but have no maximum limit!\n\nA gift of $25 can give a family who was recently homeless kitchen utensils for their new home. A $250 gift can help a family purchase groceries for a month. A $1,000 donation can help someone with a security deposit!\n\nAnd, if all of you decide to give at once, there's a chance we can win up to $4,000 in prizes!\n\nThanks to matching grants for this annual day of giving, the nonprofit with the most different donors between 9 a.m. and 10 a.m. will win an additional $4,000. \n\nWe need your help to achieve our goal! If you remember to donate to Abode Services when you get to work at 9 a.m. on May 5th, our participants could have $4,000 more dollars to help with their #movingday! \n\nIn the following weeks, we will be updating this page regularly with more information and inspiration leading up to May 5th.\n\nPlease share this event with friends and families, tell us who helped you during your last moving day, and plan to donate at 9 a.m. on May 5th!\n\nVisit our donation site at: http:\/\/tinyurl.com\/abodemovingday!","name":"Abode Services East Bay Gives 2015","place":{"name":"Abode Services","location":{"city":"Fremont","country":"United States","latitude":37.53376,"longitude":-121.96229,"state":"CA","street":"40849 Fremont Blvd","zip":"94538"},"id":"191454139310"},"start_time":"2015-05-05T00:00:00-0700","id":"374168722788898"},{"description":"Please Join Abode Services for an evening of music, poetry, and spoken word during the inaugural \"Feed Your Soul\" performance night at Mission Coffee on Thursday, November 20th at 7 p.m.\n\nThis event is a part of National Hunger and Homelessness Awareness Week, a national campaign to raise awareness about homelessness. \n\nWhile enjoying an evening of entertainment, you'll have the opportunity to learn more about what you can do to help move people from the street into homes.\n\nWe are grateful to be working with Mission Coffee and Brask House Concerts, which has worked to bring you four musical acts including Michael McNevin, an accomplished folk song performer. In addition, you'll hear poetry and spoken word from people who can help us better understand the impact homelessness has on individuals, families, and the community.\n\nThere is no cover charge to attend, but voluntary donations of gift cards and canned food would be greatly appreciated!\n\nFor more information about \"Feed Your Soul,\" contact Rosa Baeza at (510) 657-7409 ext. 220 or rbaeza\u0040abodeservices.org","name":"Abode Services Presents Feed Your Soul: An Evening of Music and Poetry","place":{"name":"Mission Coffee Roasting Company","location":{"city":"Fremont","country":"United States","latitude":37.5334999,"longitude":-121.92091,"state":"CA","street":"151 Washington Blvd","zip":"94539"},"id":"199501583458576"},"start_time":"2014-11-20T19:00:00-0800","id":"325156104337703"},{"description":"Donate online at http:\/\/bit.ly\/1iDTOt9 and help us end homelessness!","end_time":"2014-05-07T00:00:00-0700","name":"Silicon Valley Gives (\u0040svgives)","place":{"name":"Abode Services","location":{"city":"Fremont","country":"United States","latitude":37.53376,"longitude":-121.96229,"state":"CA","street":"40849 Fremont Blvd","zip":"94538"},"id":"191454139310"},"start_time":"2014-05-06T00:00:00-0700","id":"1469052093329686"},{"description":"We've all witnessed the devastating costs of homelessness. We see it in our streets and read about it in the news. What we don't always see is the important work that goes on behind the scenes to help people escape homelessness and find safe places to live - places to call home.\n\nOur Journey Home Tours are intended to give people who care about ending homelessness - people like you - a chance to see this work for themselves. During the tour, you'll not only see the facilities where individuals and families find housing and services; you'll also get a chance to meet board members and staff, and to hear from residents who are making the transition out of homelessness.\n\nTours are free and last just one hour.","end_time":"2012-09-18T13:30:00-0700","name":"Journey Home Tour- Sunrise Village Emergency Shelter","start_time":"2012-09-18T12:30:00-0700","id":"483947834956178"}],"paging":{"cursors":{"before":"OTM3OTY4MTA2MzQ2NjM1","after":"NDgzOTQ3ODM0OTU2MTc4"}}}